# St7SetBeamHeatSource1

Sets the heat source for the specified beam.

long St7SetBeamHeatSource1(long uID, long BeamNum, long CaseNum, double* Doubles)
Input Parameters
uID
Strand7 model file ID.
BeamNum
Beam number.
CaseNum
Load case number.
Doubles[0]
Heat source.